function [N,SHP] = basic_shape_iQS4 (s,t,ENC)
% shape function for an element of 2-dimension and 4-node——返回形函数矩阵与形函数微分矩阵
% xi,eta --- local coordinate——局部坐标
% SHP(4) --- shape functions——形函数矩阵(未修改为QS4形函数)
% DSHP(6,4) --- derivative of shape function——形函数的微分矩阵
% ENC(4,2) --- 单元节点坐标，x|y
% ---------------------------
a1 = ENC(1,1) - ENC(2,1);
a2 = ENC(2,1) - ENC(3,1);
a3 = ENC(3,1) - ENC(4,1);
a4 = ENC(4,1) - ENC(1,1);
b1 = ENC(2,2) - ENC(1,2);
b2 = ENC(3,2) - ENC(2,2);
b3 = ENC(4,2) - ENC(3,2);
b4 = ENC(1,2) - ENC(4,2);
s1 = -1;
s2 = 1;
s3 = 1;
s4 = -1;
t1 = -1;
t2 = -1;
t3 = 1;
t4 = 1;
% ---------------------------
N1 = 0.25*(1+s1*s)*(1+t1*t);
N2 = 0.25*(1+s2*s)*(1+t2*t);
N3 = 0.25*(1+s3*s)*(1+t3*t);
N4 = 0.25*(1+s4*s)*(1+t4*t);

N5 = 1/16*(1-s^2)*(1+t1*t);
N6 = 1/16*(1+s2*s)*(1-t^2);
N7 = 1/16*(1-s^2)*(1+t3*t);
N8 = 1/16*(1+s4*s)*(1-t^2);
% ---------------------------
M1 = a4*N8-a1*N5;
M2 = a1*N5-a2*N6;
M3 = a2*N6-a3*N7;
M4 = a3*N7-a4*N8;
% ---------------------------
L1 = b4*N8-b1*N5;
L2 = b1*N5-b2*N6;
L3 = b2*N6-b3*N7;
L4 = b3*N7-b4*N8;
% ---------------------------
matN1 = [N1,0,0,0,0,L1;
         0,N1,0,0,0,M1;
         0,0,N1,-L1,-M1,0;
         0,0,0,-N1,0,0;
         0,0,0,0,N1,0];
matN2 = [N2,0,0,0,0,L2;
         0,N2,0,0,0,M2;
         0,0,N2,-L2,-M2,0;
         0,0,0,-N2,0,0;
         0,0,0,0,N2,0];
matN3 = [N3,0,0,0,0,L3;
         0,N3,0,0,0,M3;
         0,0,N3,-L3,-M3,0;
         0,0,0,-N3,0,0;
         0,0,0,0,N3,0];
matN4 = [N4,0,0,0,0,L4;
         0,N4,0,0,0,M4;
         0,0,N4,-L4,-M4,0;
         0,0,0,-N4,0,0;
         0,0,0,0,N4,0];
N = [matN1,matN2,matN3,matN4];
SHP = [N1,N2,N3,N4];
%----------------------------
end
